#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.aws_iam_policy_document.apigw_logs: Refreshing state...
data.aws_iam_policy_document.apigw_assume: Refreshing state...
data.aws_ssm_parameter.orgs_map: Refreshing state...
aws_organizations_organization.org: Refreshing state... [id=o-khnyu61nvn]
aws_dynamodb_table.blue_tfstate: Refreshing state... [id=TerraformStateLock]
aws_iam_role.apigw_logs: Refreshing state... [id=APIGWCloudWatchGlobal]
aws_iam_role_policy.apigw_logs: Refreshing state... [id=APIGWCloudWatchGlobal:APIGWLogs]
aws_organizations_account.indigo: Refreshing state... [id=760208797553]
aws_organizations_account.grey: Refreshing state... [id=925497362398]
aws_organizations_account.blue: Refreshing state... [id=372916070974]
aws_s3_bucket.blue_tfstate: Refreshing state... [id=terraform-state-372916070974]
aws_dynamodb_table.indigo_tfstate: Refreshing state... [id=TerraformStateLock]
aws_s3_bucket.indigo_tfstate: Refreshing state... [id=terraform-state-760208797553]
aws_dynamodb_table.grey_tfstate: Refreshing state... [id=TerraformStateLock]
aws_s3_bucket.grey_tfstate: Refreshing state... [id=terraform-state-925497362398]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_organizations_policy.ai_opt_out will be created
  + resource "aws_organizations_policy" "ai_opt_out" {
      + arn     = (known after apply)
      + content = jsonencode(
            {
              + services = {
                  + @@operators_allowed_for_child_policies = [
                      + "@@none",
                    ]
                  + default                                = {
                      + @@operators_allowed_for_child_policies = [
                          + "@@none",
                        ]
                      + opt_out_policy                         = {
                          + @@assign                               = "optOut"
                          + @@operators_allowed_for_child_policies = [
                              + "@@none",
                            ]
                        }
                    }
                }
            }
        )
      + id      = (known after apply)
      + name    = "AIServicesOptOutAll"
      + type    = "SERVICE_CONTROL_POLICY"
    }

  # aws_organizations_policy_attachment.ai_opt_out_root["r-4lxd"] will be created
  + resource "aws_organizations_policy_attachment" "ai_opt_out_root" {
      + id        = (known after apply)
      + policy_id = (known after apply)
      + target_id = "r-4lxd"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @MrGossett, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*